keeper999/EngineControl_Aurix/01_Get_Src/BSW/VD56_BSW/VD56_GEN_BSW/MCAL_TC29X_DRV_P1/Drv/IfxPsi5_regdef.h
/** \\brief  Interrupt Status Register B */
typedef struct _Ifx_PSI5_INTSTATB_Bits
{
    unsigned int WSI0:1;                    /**< \brief [0:0] Wrong Serial Protocol Error Request Flag (rh) */
    unsigned int WSI1:1;                    /**< \brief [1:1] Wrong Serial Protocol Error Request Flag (rh) */
    unsigned int WSI2:1;                    /**< \brief [2:2] Wrong Serial Protocol Error Request Flag (rh) */
    unsigned int WSI3:1;                    /**< \brief [3:3] Wrong Serial Protocol Error Request Flag (rh) */
    unsigned int WSI4:1;                    /**< \brief [4:4] Wrong Serial Protocol Error Request Flag (rh) */
    unsigned int WSI5:1;                    /**< \brief [5:5] Wrong Serial Protocol Error Request Flag (rh) */
    unsigned int SDI0:1;                    /**< \brief [6:6] Serial Data Receive Interrupt Request Flag (rh) */
    unsigned int SDI1:1;                    /**< \brief [7:7] Serial Data Receive Interrupt Request Flag (rh) */
    unsigned int SDI2:1;                    /**< \brief [8:8] Serial Data Receive Interrupt Request Flag (rh) */
    unsigned int SDI3:1;                    /**< \brief [9:9] Serial Data Receive Interrupt Request Flag (rh) */
    unsigned int SDI4:1;                    /**< \brief [10:10] Serial Data Receive Interrupt Request Flag (rh) */
    unsigned int SDI5:1;                    /**< \brief [11:11] Serial Data Receive Interrupt Request Flag (rh) */
    unsigned int SOI0:1;                    /**< \brief [12:12] Serial Data Buffer Overrun Interrupt Request Flag (rh) */
    unsigned int SOI1:1;                    /**< \brief [13:13] Serial Data Buffer Overrun Interrupt Request Flag (rh) */
    unsigned int SOI2:1;                    /**< \brief [14:14] Serial Data Buffer Overrun Interrupt Request Flag (rh) */
    unsigned int SOI3:1;                    /**< \brief [15:15] Serial Data Buffer Overrun Interrupt Request Flag (rh) */
    unsigned int SOI4:1;                    /**< \brief [16:16] Serial Data Buffer Overrun Interrupt Request Flag (rh) */
    unsigned int SOI5:1;                    /**< \brief [17:17] Serial Data Buffer Overrun Interrupt Request Flag (rh) */
    unsigned int SCRI0:1;                   /**< \brief [18:18] Serial Data CRC Error Request Flag (rh) */
    unsigned int SCRI1:1;                   /**< \brief [19:19] Serial Data CRC Error Request Flag (rh) */
    unsigned int SCRI2:1;                   /**< \brief [20:20] Serial Data CRC Error Request Flag (rh) */
    unsigned int SCRI3:1;                   /**< \brief [21:21] Serial Data CRC Error Request Flag (rh) */
    unsigned int SCRI4:1;                   /**< \brief [22:22] Serial Data CRC Error Request Flag (rh) */
    unsigned int SCRI5:1;                   /**< \brief [23:23] Serial Data CRC Error Request Flag (rh) */
    unsigned int reserved_24:8;             /**< \brief \internal Reserved */
} Ifx_PSI5_INTSTATB_Bits;

/** \\brief  Kernel Reset Register 0 */
typedef struct _Ifx_PSI5_KRST0_Bits
{
    unsigned int RST:1;                     /**< \brief [0:0] Kernel Reset (rwh) */
    unsigned int RSTSTAT:1;                 /**< \brief [1:1] Kernel Reset Status (rh) */
    unsigned int reserved_2:30;             /**< \brief \internal Reserved */
} Ifx_PSI5_KRST0_Bits;

/** \\brief  Kernel Reset Register 1 */
typedef struct _Ifx_PSI5_KRST1_Bits
{
    unsigned int RST:1;                     /**< \brief [0:0] Kernel Reset (rwh) */
    unsigned int reserved_1:31;             /**< \brief \internal Reserved */
} Ifx_PSI5_KRST1_Bits;

/** \\brief  Kernel Reset Status Clear Register */
typedef struct _Ifx_PSI5_KRSTCLR_Bits
{
    unsigned int CLR:1;                     /**< \brief [0:0] Kernel Reset Status Clear (w) */
    unsigned int reserved_1:31;             /**< \brief \internal Reserved */
} Ifx_PSI5_KRSTCLR_Bits;

/** \\brief  MEIOV Clear Register */
typedef struct _Ifx_PSI5_MEICLR_Bits
{
    unsigned int MEI0:1;                    /**< \brief [0:0] Clear MEI Flag of Buffer y (w) */
    unsigned int MEI1:1;                    /**< \brief [1:1] Clear MEI Flag of Buffer y (w) */
    unsigned int MEI2:1;                    /**< \brief [2:2] Clear MEI Flag of Buffer y (w) */
    unsigned int MEI3:1;                    /**< \brief [3:3] Clear MEI Flag of Buffer y (w) */
    unsigned int MEI4:1;                    /**< \brief [4:4] Clear MEI Flag of Buffer y (w) */
    unsigned int MEI5:1;                    /**< \brief [5:5] Clear MEI Flag of Buffer y (w) */
    unsigned int MEI6:1;                    /**< \brief [6:6] Clear MEI Flag of Buffer y (w) */
    unsigned int MEI7:1;                    /**< \brief [7:7] Clear MEI Flag of Buffer y (w) */
    unsigned int MEI8:1;                    /**< \brief [8:8] Clear MEI Flag of Buffer y (w) */
    unsigned int MEI9:1;                    /**< \brief [9:9] Clear MEI Flag of Buffer y (w) */
    unsigned int MEI10:1;                   /**< \brief [10:10] Clear MEI Flag of Buffer y (w) */
    unsigned int MEI11:1;                   /**< \brief [11:11] Clear MEI Flag of Buffer y (w) */
    unsigned int MEI12:1;                   /**< \brief [12:12] Clear MEI Flag of Buffer y (w) */
    unsigned int MEI13:1;                   /**< \brief [13:13] Clear MEI Flag of Buffer y (w) */
    unsigned int MEI14:1;                   /**< \brief [14:14] Clear MEI Flag of Buffer y (w) */
    unsigned int MEI15:1;                   /**< \brief [15:15] Clear MEI Flag of Buffer y (w) */
    unsigned int MEI16:1;                   /**< \brief [16:16] Clear MEI Flag of Buffer y (w) */
    unsigned int MEI17:1;                   /**< \brief [17:17] Clear MEI Flag of Buffer y (w) */
    unsigned int MEI18:1;                   /**< \brief [18:18] Clear MEI Flag of Buffer y (w) */
    unsigned int MEI19:1;                   /**< \brief [19:19] Clear MEI Flag of Buffer y (w) */
    unsigned int MEI20:1;                   /**< \brief [20:20] Clear MEI Flag of Buffer y (w) */
    unsigned int MEI21:1;                   /**< \brief [21:21] Clear MEI Flag of Buffer y (w) */
    unsigned int MEI22:1;                   /**< \brief [22:22] Clear MEI Flag of Buffer y (w) */
    unsigned int MEI23:1;                   /**< \brief [23:23] Clear MEI Flag of Buffer y (w) */
    unsigned int MEI24:1;                   /**< \brief [24:24] Clear MEI Flag of Buffer y (w) */
    unsigned int MEI25:1;                   /**< \brief [25:25] Clear MEI Flag of Buffer y (w) */
    unsigned int MEI26:1;                   /**< \brief [26:26] Clear MEI Flag of Buffer y (w) */
    unsigned int MEI27:1;                   /**< \brief [27:27] Clear MEI Flag of Buffer y (w) */
    unsigned int MEI28:1;                   /**< \brief [28:28] Clear MEI Flag of Buffer y (w) */
    unsigned int MEI29:1;                   /**< \brief [29:29] Clear MEI Flag of Buffer y (w) */
    unsigned int MEI30:1;                   /**< \brief [30:30] Clear MEI Flag of Buffer y (w) */
    unsigned int MEI31:1;                   /**< \brief [31:31] Clear MEI Flag of Buffer y (w) */
} Ifx_PSI5_MEICLR_Bits;

