keeper999/EngineControl_Aurix/01_Get_Src/BSW/VD56_BSW/VD56_GEN_BSW/MCAL_TC29X_DRV_P1/Drv/IfxPsi5_regdef.h
/** \\brief  NFIOV Clear Register */
typedef struct _Ifx_PSI5_NFICLR_Bits
{
    unsigned int NFI0:1;                    /**< \brief [0:0] Clear NFI Flag of Buffer y (w) */
    unsigned int NFI1:1;                    /**< \brief [1:1] Clear NFI Flag of Buffer y (w) */
    unsigned int NFI2:1;                    /**< \brief [2:2] Clear NFI Flag of Buffer y (w) */
    unsigned int NFI3:1;                    /**< \brief [3:3] Clear NFI Flag of Buffer y (w) */
    unsigned int NFI4:1;                    /**< \brief [4:4] Clear NFI Flag of Buffer y (w) */
    unsigned int NFI5:1;                    /**< \brief [5:5] Clear NFI Flag of Buffer y (w) */
    unsigned int NFI6:1;                    /**< \brief [6:6] Clear NFI Flag of Buffer y (w) */
    unsigned int NFI7:1;                    /**< \brief [7:7] Clear NFI Flag of Buffer y (w) */
    unsigned int NFI8:1;                    /**< \brief [8:8] Clear NFI Flag of Buffer y (w) */
    unsigned int NFI9:1;                    /**< \brief [9:9] Clear NFI Flag of Buffer y (w) */
    unsigned int NFI10:1;                   /**< \brief [10:10] Clear NFI Flag of Buffer y (w) */
    unsigned int NFI11:1;                   /**< \brief [11:11] Clear NFI Flag of Buffer y (w) */
    unsigned int NFI12:1;                   /**< \brief [12:12] Clear NFI Flag of Buffer y (w) */
    unsigned int NFI13:1;                   /**< \brief [13:13] Clear NFI Flag of Buffer y (w) */
    unsigned int NFI14:1;                   /**< \brief [14:14] Clear NFI Flag of Buffer y (w) */
    unsigned int NFI15:1;                   /**< \brief [15:15] Clear NFI Flag of Buffer y (w) */
    unsigned int NFI16:1;                   /**< \brief [16:16] Clear NFI Flag of Buffer y (w) */
    unsigned int NFI17:1;                   /**< \brief [17:17] Clear NFI Flag of Buffer y (w) */
    unsigned int NFI18:1;                   /**< \brief [18:18] Clear NFI Flag of Buffer y (w) */
    unsigned int NFI19:1;                   /**< \brief [19:19] Clear NFI Flag of Buffer y (w) */
    unsigned int NFI20:1;                   /**< \brief [20:20] Clear NFI Flag of Buffer y (w) */
    unsigned int NFI21:1;                   /**< \brief [21:21] Clear NFI Flag of Buffer y (w) */
    unsigned int NFI22:1;                   /**< \brief [22:22] Clear NFI Flag of Buffer y (w) */
    unsigned int NFI23:1;                   /**< \brief [23:23] Clear NFI Flag of Buffer y (w) */
    unsigned int NFI24:1;                   /**< \brief [24:24] Clear NFI Flag of Buffer y (w) */
    unsigned int NFI25:1;                   /**< \brief [25:25] Clear NFI Flag of Buffer y (w) */
    unsigned int NFI26:1;                   /**< \brief [26:26] Clear NFI Flag of Buffer y (w) */
    unsigned int NFI27:1;                   /**< \brief [27:27] Clear NFI Flag of Buffer y (w) */
    unsigned int NFI28:1;                   /**< \brief [28:28] Clear NFI Flag of Buffer y (w) */
    unsigned int NFI29:1;                   /**< \brief [29:29] Clear NFI Flag of Buffer y (w) */
    unsigned int NFI30:1;                   /**< \brief [30:30] Clear NFI Flag of Buffer y (w) */
    unsigned int NFI31:1;                   /**< \brief [31:31] Clear NFI Flag of Buffer y (w) */
} Ifx_PSI5_NFICLR_Bits;

/** \\brief  NFI Overview Register */
typedef struct _Ifx_PSI5_NFIOV_Bits
{
    unsigned int NFI0:1;                    /**< \brief [0:0] NFI Flag of Buffer y (rh) */
    unsigned int NFI1:1;                    /**< \brief [1:1] NFI Flag of Buffer y (rh) */
    unsigned int NFI2:1;                    /**< \brief [2:2] NFI Flag of Buffer y (rh) */
    unsigned int NFI3:1;                    /**< \brief [3:3] NFI Flag of Buffer y (rh) */
    unsigned int NFI4:1;                    /**< \brief [4:4] NFI Flag of Buffer y (rh) */
    unsigned int NFI5:1;                    /**< \brief [5:5] NFI Flag of Buffer y (rh) */
    unsigned int NFI6:1;                    /**< \brief [6:6] NFI Flag of Buffer y (rh) */
    unsigned int NFI7:1;                    /**< \brief [7:7] NFI Flag of Buffer y (rh) */
    unsigned int NFI8:1;                    /**< \brief [8:8] NFI Flag of Buffer y (rh) */
    unsigned int NFI9:1;                    /**< \brief [9:9] NFI Flag of Buffer y (rh) */
    unsigned int NFI10:1;                   /**< \brief [10:10] NFI Flag of Buffer y (rh) */
    unsigned int NFI11:1;                   /**< \brief [11:11] NFI Flag of Buffer y (rh) */
    unsigned int NFI12:1;                   /**< \brief [12:12] NFI Flag of Buffer y (rh) */
    unsigned int NFI13:1;                   /**< \brief [13:13] NFI Flag of Buffer y (rh) */
    unsigned int NFI14:1;                   /**< \brief [14:14] NFI Flag of Buffer y (rh) */
    unsigned int NFI15:1;                   /**< \brief [15:15] NFI Flag of Buffer y (rh) */
    unsigned int NFI16:1;                   /**< \brief [16:16] NFI Flag of Buffer y (rh) */
    unsigned int NFI17:1;                   /**< \brief [17:17] NFI Flag of Buffer y (rh) */
    unsigned int NFI18:1;                   /**< \brief [18:18] NFI Flag of Buffer y (rh) */
    unsigned int NFI19:1;                   /**< \brief [19:19] NFI Flag of Buffer y (rh) */
    unsigned int NFI20:1;                   /**< \brief [20:20] NFI Flag of Buffer y (rh) */
    unsigned int NFI21:1;                   /**< \brief [21:21] NFI Flag of Buffer y (rh) */
    unsigned int NFI22:1;                   /**< \brief [22:22] NFI Flag of Buffer y (rh) */
    unsigned int NFI23:1;                   /**< \brief [23:23] NFI Flag of Buffer y (rh) */
    unsigned int NFI24:1;                   /**< \brief [24:24] NFI Flag of Buffer y (rh) */
    unsigned int NFI25:1;                   /**< \brief [25:25] NFI Flag of Buffer y (rh) */
    unsigned int NFI26:1;                   /**< \brief [26:26] NFI Flag of Buffer y (rh) */
    unsigned int NFI27:1;                   /**< \brief [27:27] NFI Flag of Buffer y (rh) */
    unsigned int NFI28:1;                   /**< \brief [28:28] NFI Flag of Buffer y (rh) */
    unsigned int NFI29:1;                   /**< \brief [29:29] NFI Flag of Buffer y (rh) */
    unsigned int NFI30:1;                   /**< \brief [30:30] NFI Flag of Buffer y (rh) */
    unsigned int NFI31:1;                   /**< \brief [31:31] NFI Flag of Buffer y (rh) */
} Ifx_PSI5_NFIOV_Bits;

/** \\brief  NFIOV Set Register */
typedef struct _Ifx_PSI5_NFISET_Bits
{
    unsigned int NFI0:1;                    /**< \brief [0:0] Set NFI Flag of Buffer y (w) */
    unsigned int NFI1:1;                    /**< \brief [1:1] Set NFI Flag of Buffer y (w) */
    unsigned int NFI2:1;                    /**< \brief [2:2] Set NFI Flag of Buffer y (w) */
    unsigned int NFI3:1;                    /**< \brief [3:3] Set NFI Flag of Buffer y (w) */
    unsigned int NFI4:1;                    /**< \brief [4:4] Set NFI Flag of Buffer y (w) */
    unsigned int NFI5:1;                    /**< \brief [5:5] Set NFI Flag of Buffer y (w) */
    unsigned int NFI6:1;                    /**< \brief [6:6] Set NFI Flag of Buffer y (w) */
    unsigned int NFI7:1;                    /**< \brief [7:7] Set NFI Flag of Buffer y (w) */
    unsigned int NFI8:1;                    /**< \brief [8:8] Set NFI Flag of Buffer y (w) */
    unsigned int NFI9:1;                    /**< \brief [9:9] Set NFI Flag of Buffer y (w) */
    unsigned int NFI10:1;                   /**< \brief [10:10] Set NFI Flag of Buffer y (w) */
    unsigned int NFI11:1;                   /**< \brief [11:11] Set NFI Flag of Buffer y (w) */
    unsigned int NFI12:1;                   /**< \brief [12:12] Set NFI Flag of Buffer y (w) */
    unsigned int NFI13:1;                   /**< \brief [13:13] Set NFI Flag of Buffer y (w) */
    unsigned int NFI14:1;                   /**< \brief [14:14] Set NFI Flag of Buffer y (w) */
    unsigned int NFI15:1;                   /**< \brief [15:15] Set NFI Flag of Buffer y (w) */
    unsigned int NFI16:1;                   /**< \brief [16:16] Set NFI Flag of Buffer y (w) */
    unsigned int NFI17:1;                   /**< \brief [17:17] Set NFI Flag of Buffer y (w) */
    unsigned int NFI18:1;                   /**< \brief [18:18] Set NFI Flag of Buffer y (w) */
    unsigned int NFI19:1;                   /**< \brief [19:19] Set NFI Flag of Buffer y (w) */
    unsigned int NFI20:1;                   /**< \brief [20:20] Set NFI Flag of Buffer y (w) */
    unsigned int NFI21:1;                   /**< \brief [21:21] Set NFI Flag of Buffer y (w) */
    unsigned int NFI22:1;                   /**< \brief [22:22] Set NFI Flag of Buffer y (w) */
    unsigned int NFI23:1;                   /**< \brief [23:23] Set NFI Flag of Buffer y (w) */
    unsigned int NFI24:1;                   /**< \brief [24:24] Set NFI Flag of Buffer y (w) */
    unsigned int NFI25:1;                   /**< \brief [25:25] Set NFI Flag of Buffer y (w) */
    unsigned int NFI26:1;                   /**< \brief [26:26] Set NFI Flag of Buffer y (w) */
    unsigned int NFI27:1;                   /**< \brief [27:27] Set NFI Flag of Buffer y (w) */
    unsigned int NFI28:1;                   /**< \brief [28:28] Set NFI Flag of Buffer y (w) */
    unsigned int NFI29:1;                   /**< \brief [29:29] Set NFI Flag of Buffer y (w) */
    unsigned int NFI30:1;                   /**< \brief [30:30] Set NFI Flag of Buffer y (w) */
    unsigned int NFI31:1;                   /**< \brief [31:31] Set NFI Flag of Buffer y (w) */
} Ifx_PSI5_NFISET_Bits;

