keeper999/EngineControl_Aurix/01_Get_Src/BSW/VD56_BSW/VD56_GEN_BSW/MCAL_TC29X_DRV_P1/Drv/IfxPsi5_regdef.h
/** \\brief  Receive Data Memory Low */
typedef struct _Ifx_PSI5_RDM_L_Bits
{
    unsigned int CRCI:1;                    /**< \brief [0:0] CRC Error Flag (rh) */
    unsigned int CRC:3;                     /**< \brief [3:1] CRC (rh) */
    unsigned int RD:28;                     /**< \brief [31:4] RD (rh) */
} Ifx_PSI5_RDM_L_Bits;

/** \\brief  Receive FIFO Control Register */
typedef struct _Ifx_PSI5_RFC_Bits
{
    unsigned int REP:6;                     /**< \brief [5:0] FIFO Read Pointer (r) */
    unsigned int reserved_6:2;              /**< \brief \internal Reserved */
    unsigned int WRP:6;                     /**< \brief [13:8] FIFO/Ring Buffer Write Pointer (r) */
    unsigned int reserved_14:2;             /**< \brief \internal Reserved */
    unsigned int FWL:5;                     /**< \brief [20:16] FIFO Warning Level (rw) */
    unsigned int reserved_21:8;             /**< \brief \internal Reserved */
    unsigned int WRAP:1;                    /**< \brief [29:29] Write Pointer WRAP Indicator (r) */
    unsigned int FRQ:1;                     /**< \brief [30:30] Flush Request (r) */
    unsigned int FLU:1;                     /**< \brief [31:31] Flush (w) */
} Ifx_PSI5_RFC_Bits;

/** \\brief  RMIOV Clear Register */
typedef struct _Ifx_PSI5_RMICLR_Bits
{
    unsigned int RMI0:1;                    /**< \brief [0:0] Clear RMI Flag of Buffer y (w) */
    unsigned int RMI1:1;                    /**< \brief [1:1] Clear RMI Flag of Buffer y (w) */
    unsigned int RMI2:1;                    /**< \brief [2:2] Clear RMI Flag of Buffer y (w) */
    unsigned int RMI3:1;                    /**< \brief [3:3] Clear RMI Flag of Buffer y (w) */
    unsigned int RMI4:1;                    /**< \brief [4:4] Clear RMI Flag of Buffer y (w) */
    unsigned int RMI5:1;                    /**< \brief [5:5] Clear RMI Flag of Buffer y (w) */
    unsigned int RMI6:1;                    /**< \brief [6:6] Clear RMI Flag of Buffer y (w) */
    unsigned int RMI7:1;                    /**< \brief [7:7] Clear RMI Flag of Buffer y (w) */
    unsigned int RMI8:1;                    /**< \brief [8:8] Clear RMI Flag of Buffer y (w) */
    unsigned int RMI9:1;                    /**< \brief [9:9] Clear RMI Flag of Buffer y (w) */
    unsigned int RMI10:1;                   /**< \brief [10:10] Clear RMI Flag of Buffer y (w) */
    unsigned int RMI11:1;                   /**< \brief [11:11] Clear RMI Flag of Buffer y (w) */
    unsigned int RMI12:1;                   /**< \brief [12:12] Clear RMI Flag of Buffer y (w) */
    unsigned int RMI13:1;                   /**< \brief [13:13] Clear RMI Flag of Buffer y (w) */
    unsigned int RMI14:1;                   /**< \brief [14:14] Clear RMI Flag of Buffer y (w) */
    unsigned int RMI15:1;                   /**< \brief [15:15] Clear RMI Flag of Buffer y (w) */
    unsigned int RMI16:1;                   /**< \brief [16:16] Clear RMI Flag of Buffer y (w) */
    unsigned int RMI17:1;                   /**< \brief [17:17] Clear RMI Flag of Buffer y (w) */
    unsigned int RMI18:1;                   /**< \brief [18:18] Clear RMI Flag of Buffer y (w) */
    unsigned int RMI19:1;                   /**< \brief [19:19] Clear RMI Flag of Buffer y (w) */
    unsigned int RMI20:1;                   /**< \brief [20:20] Clear RMI Flag of Buffer y (w) */
    unsigned int RMI21:1;                   /**< \brief [21:21] Clear RMI Flag of Buffer y (w) */
    unsigned int RMI22:1;                   /**< \brief [22:22] Clear RMI Flag of Buffer y (w) */
    unsigned int RMI23:1;                   /**< \brief [23:23] Clear RMI Flag of Buffer y (w) */
    unsigned int RMI24:1;                   /**< \brief [24:24] Clear RMI Flag of Buffer y (w) */
    unsigned int RMI25:1;                   /**< \brief [25:25] Clear RMI Flag of Buffer y (w) */
    unsigned int RMI26:1;                   /**< \brief [26:26] Clear RMI Flag of Buffer y (w) */
    unsigned int RMI27:1;                   /**< \brief [27:27] Clear RMI Flag of Buffer y (w) */
    unsigned int RMI28:1;                   /**< \brief [28:28] Clear RMI Flag of Buffer y (w) */
    unsigned int RMI29:1;                   /**< \brief [29:29] Clear RMI Flag of Buffer y (w) */
    unsigned int RMI30:1;                   /**< \brief [30:30] Clear RMI Flag of Buffer y (w) */
    unsigned int RMI31:1;                   /**< \brief [31:31] Clear RMI Flag of Buffer y (w) */
} Ifx_PSI5_RMICLR_Bits;

/** \\brief  RMI Overview Register */
typedef struct _Ifx_PSI5_RMIOV_Bits
{
    unsigned int RMI0:1;                    /**< \brief [0:0] RMI Flag of Buffer y (rh) */
    unsigned int RMI1:1;                    /**< \brief [1:1] RMI Flag of Buffer y (rh) */
    unsigned int RMI2:1;                    /**< \brief [2:2] RMI Flag of Buffer y (rh) */
    unsigned int RMI3:1;                    /**< \brief [3:3] RMI Flag of Buffer y (rh) */
    unsigned int RMI4:1;                    /**< \brief [4:4] RMI Flag of Buffer y (rh) */
    unsigned int RMI5:1;                    /**< \brief [5:5] RMI Flag of Buffer y (rh) */
    unsigned int RMI6:1;                    /**< \brief [6:6] RMI Flag of Buffer y (rh) */
    unsigned int RMI7:1;                    /**< \brief [7:7] RMI Flag of Buffer y (rh) */
    unsigned int RMI8:1;                    /**< \brief [8:8] RMI Flag of Buffer y (rh) */
    unsigned int RMI9:1;                    /**< \brief [9:9] RMI Flag of Buffer y (rh) */
    unsigned int RMI10:1;                   /**< \brief [10:10] RMI Flag of Buffer y (rh) */
    unsigned int RMI11:1;                   /**< \brief [11:11] RMI Flag of Buffer y (rh) */
    unsigned int RMI12:1;                   /**< \brief [12:12] RMI Flag of Buffer y (rh) */
    unsigned int RMI13:1;                   /**< \brief [13:13] RMI Flag of Buffer y (rh) */
    unsigned int RMI14:1;                   /**< \brief [14:14] RMI Flag of Buffer y (rh) */
    unsigned int RMI15:1;                   /**< \brief [15:15] RMI Flag of Buffer y (rh) */
    unsigned int RMI16:1;                   /**< \brief [16:16] RMI Flag of Buffer y (rh) */
    unsigned int RMI17:1;                   /**< \brief [17:17] RMI Flag of Buffer y (rh) */
    unsigned int RMI18:1;                   /**< \brief [18:18] RMI Flag of Buffer y (rh) */
    unsigned int RMI19:1;                   /**< \brief [19:19] RMI Flag of Buffer y (rh) */
    unsigned int RMI20:1;                   /**< \brief [20:20] RMI Flag of Buffer y (rh) */
    unsigned int RMI21:1;                   /**< \brief [21:21] RMI Flag of Buffer y (rh) */
    unsigned int RMI22:1;                   /**< \brief [22:22] RMI Flag of Buffer y (rh) */
    unsigned int RMI23:1;                   /**< \brief [23:23] RMI Flag of Buffer y (rh) */
    unsigned int RMI24:1;                   /**< \brief [24:24] RMI Flag of Buffer y (rh) */
    unsigned int RMI25:1;                   /**< \brief [25:25] RMI Flag of Buffer y (rh) */
    unsigned int RMI26:1;                   /**< \brief [26:26] RMI Flag of Buffer y (rh) */
    unsigned int RMI27:1;                   /**< \brief [27:27] RMI Flag of Buffer y (rh) */
    unsigned int RMI28:1;                   /**< \brief [28:28] RMI Flag of Buffer y (rh) */
    unsigned int RMI29:1;                   /**< \brief [29:29] RMI Flag of Buffer y (rh) */
    unsigned int RMI30:1;                   /**< \brief [30:30] RMI Flag of Buffer y (rh) */
    unsigned int RMI31:1;                   /**< \brief [31:31] RMI Flag of Buffer y (rh) */
} Ifx_PSI5_RMIOV_Bits;

/** \\brief  RMIOV Set Register */
typedef struct _Ifx_PSI5_RMISET_Bits
{
    unsigned int RMI0:1;                    /**< \brief [0:0] Set RMI Flag of Buffer y (w) */
    unsigned int RMI1:1;                    /**< \brief [1:1] Set RMI Flag of Buffer y (w) */
    unsigned int RMI2:1;                    /**< \brief [2:2] Set RMI Flag of Buffer y (w) */
    unsigned int RMI3:1;                    /**< \brief [3:3] Set RMI Flag of Buffer y (w) */
    unsigned int RMI4:1;                    /**< \brief [4:4] Set RMI Flag of Buffer y (w) */
    unsigned int RMI5:1;                    /**< \brief [5:5] Set RMI Flag of Buffer y (w) */
    unsigned int RMI6:1;                    /**< \brief [6:6] Set RMI Flag of Buffer y (w) */
    unsigned int RMI7:1;                    /**< \brief [7:7] Set RMI Flag of Buffer y (w) */
    unsigned int RMI8:1;                    /**< \brief [8:8] Set RMI Flag of Buffer y (w) */
    unsigned int RMI9:1;                    /**< \brief [9:9] Set RMI Flag of Buffer y (w) */
    unsigned int RMI10:1;                   /**< \brief [10:10] Set RMI Flag of Buffer y (w) */
    unsigned int RMI11:1;                   /**< \brief [11:11] Set RMI Flag of Buffer y (w) */
    unsigned int RMI12:1;                   /**< \brief [12:12] Set RMI Flag of Buffer y (w) */
    unsigned int RMI13:1;                   /**< \brief [13:13] Set RMI Flag of Buffer y (w) */
    unsigned int RMI14:1;                   /**< \brief [14:14] Set RMI Flag of Buffer y (w) */
    unsigned int RMI15:1;                   /**< \brief [15:15] Set RMI Flag of Buffer y (w) */
    unsigned int RMI16:1;                   /**< \brief [16:16] Set RMI Flag of Buffer y (w) */
    unsigned int RMI17:1;                   /**< \brief [17:17] Set RMI Flag of Buffer y (w) */
    unsigned int RMI18:1;                   /**< \brief [18:18] Set RMI Flag of Buffer y (w) */
    unsigned int RMI19:1;                   /**< \brief [19:19] Set RMI Flag of Buffer y (w) */
    unsigned int RMI20:1;                   /**< \brief [20:20] Set RMI Flag of Buffer y (w) */
    unsigned int RMI21:1;                   /**< \brief [21:21] Set RMI Flag of Buffer y (w) */
    unsigned int RMI22:1;                   /**< \brief [22:22] Set RMI Flag of Buffer y (w) */
    unsigned int RMI23:1;                   /**< \brief [23:23] Set RMI Flag of Buffer y (w) */
    unsigned int RMI24:1;                   /**< \brief [24:24] Set RMI Flag of Buffer y (w) */
    unsigned int RMI25:1;                   /**< \brief [25:25] Set RMI Flag of Buffer y (w) */
    unsigned int RMI26:1;                   /**< \brief [26:26] Set RMI Flag of Buffer y (w) */
    unsigned int RMI27:1;                   /**< \brief [27:27] Set RMI Flag of Buffer y (w) */
    unsigned int RMI28:1;                   /**< \brief [28:28] Set RMI Flag of Buffer y (w) */
    unsigned int RMI29:1;                   /**< \brief [29:29] Set RMI Flag of Buffer y (w) */
    unsigned int RMI30:1;                   /**< \brief [30:30] Set RMI Flag of Buffer y (w) */
    unsigned int RMI31:1;                   /**< \brief [31:31] Set RMI Flag of Buffer y (w) */
} Ifx_PSI5_RMISET_Bits;

