keeper999/EngineControl_Aurix/01_Get_Src/BSW/VD56_BSW/VD56_GEN_BSW/MCAL_TC29X_DRV_P1/Drv/IfxPsi5_regdef.h
/** \\brief  RSIOV Clear Register */
typedef struct _Ifx_PSI5_RSICLR_Bits
{
    unsigned int RSI0:1;                    /**< \brief [0:0] Clear RSI Flag of Buffer y (w) */
    unsigned int RSI1:1;                    /**< \brief [1:1] Clear RSI Flag of Buffer y (w) */
    unsigned int RSI2:1;                    /**< \brief [2:2] Clear RSI Flag of Buffer y (w) */
    unsigned int RSI3:1;                    /**< \brief [3:3] Clear RSI Flag of Buffer y (w) */
    unsigned int RSI4:1;                    /**< \brief [4:4] Clear RSI Flag of Buffer y (w) */
    unsigned int RSI5:1;                    /**< \brief [5:5] Clear RSI Flag of Buffer y (w) */
    unsigned int RSI6:1;                    /**< \brief [6:6] Clear RSI Flag of Buffer y (w) */
    unsigned int RSI7:1;                    /**< \brief [7:7] Clear RSI Flag of Buffer y (w) */
    unsigned int RSI8:1;                    /**< \brief [8:8] Clear RSI Flag of Buffer y (w) */
    unsigned int RSI9:1;                    /**< \brief [9:9] Clear RSI Flag of Buffer y (w) */
    unsigned int RSI10:1;                   /**< \brief [10:10] Clear RSI Flag of Buffer y (w) */
    unsigned int RSI11:1;                   /**< \brief [11:11] Clear RSI Flag of Buffer y (w) */
    unsigned int RSI12:1;                   /**< \brief [12:12] Clear RSI Flag of Buffer y (w) */
    unsigned int RSI13:1;                   /**< \brief [13:13] Clear RSI Flag of Buffer y (w) */
    unsigned int RSI14:1;                   /**< \brief [14:14] Clear RSI Flag of Buffer y (w) */
    unsigned int RSI15:1;                   /**< \brief [15:15] Clear RSI Flag of Buffer y (w) */
    unsigned int RSI16:1;                   /**< \brief [16:16] Clear RSI Flag of Buffer y (w) */
    unsigned int RSI17:1;                   /**< \brief [17:17] Clear RSI Flag of Buffer y (w) */
    unsigned int RSI18:1;                   /**< \brief [18:18] Clear RSI Flag of Buffer y (w) */
    unsigned int RSI19:1;                   /**< \brief [19:19] Clear RSI Flag of Buffer y (w) */
    unsigned int RSI20:1;                   /**< \brief [20:20] Clear RSI Flag of Buffer y (w) */
    unsigned int RSI21:1;                   /**< \brief [21:21] Clear RSI Flag of Buffer y (w) */
    unsigned int RSI22:1;                   /**< \brief [22:22] Clear RSI Flag of Buffer y (w) */
    unsigned int RSI23:1;                   /**< \brief [23:23] Clear RSI Flag of Buffer y (w) */
    unsigned int RSI24:1;                   /**< \brief [24:24] Clear RSI Flag of Buffer y (w) */
    unsigned int RSI25:1;                   /**< \brief [25:25] Clear RSI Flag of Buffer y (w) */
    unsigned int RSI26:1;                   /**< \brief [26:26] Clear RSI Flag of Buffer y (w) */
    unsigned int RSI27:1;                   /**< \brief [27:27] Clear RSI Flag of Buffer y (w) */
    unsigned int RSI28:1;                   /**< \brief [28:28] Clear RSI Flag of Buffer y (w) */
    unsigned int RSI29:1;                   /**< \brief [29:29] Clear RSI Flag of Buffer y (w) */
    unsigned int RSI30:1;                   /**< \brief [30:30] Clear RSI Flag of Buffer y (w) */
    unsigned int RSI31:1;                   /**< \brief [31:31] Clear RSI Flag of Buffer y (w) */
} Ifx_PSI5_RSICLR_Bits;

/** \\brief  RSI Overview Register */
typedef struct _Ifx_PSI5_RSIOV_Bits
{
    unsigned int RSI0:1;                    /**< \brief [0:0] RSI Flag of Buffer y (rh) */
    unsigned int RSI1:1;                    /**< \brief [1:1] RSI Flag of Buffer y (rh) */
    unsigned int RSI2:1;                    /**< \brief [2:2] RSI Flag of Buffer y (rh) */
    unsigned int RSI3:1;                    /**< \brief [3:3] RSI Flag of Buffer y (rh) */
    unsigned int RSI4:1;                    /**< \brief [4:4] RSI Flag of Buffer y (rh) */
    unsigned int RSI5:1;                    /**< \brief [5:5] RSI Flag of Buffer y (rh) */
    unsigned int RSI6:1;                    /**< \brief [6:6] RSI Flag of Buffer y (rh) */
    unsigned int RSI7:1;                    /**< \brief [7:7] RSI Flag of Buffer y (rh) */
    unsigned int RSI8:1;                    /**< \brief [8:8] RSI Flag of Buffer y (rh) */
    unsigned int RSI9:1;                    /**< \brief [9:9] RSI Flag of Buffer y (rh) */
    unsigned int RSI10:1;                   /**< \brief [10:10] RSI Flag of Buffer y (rh) */
    unsigned int RSI11:1;                   /**< \brief [11:11] RSI Flag of Buffer y (rh) */
    unsigned int RSI12:1;                   /**< \brief [12:12] RSI Flag of Buffer y (rh) */
    unsigned int RSI13:1;                   /**< \brief [13:13] RSI Flag of Buffer y (rh) */
    unsigned int RSI14:1;                   /**< \brief [14:14] RSI Flag of Buffer y (rh) */
    unsigned int RSI15:1;                   /**< \brief [15:15] RSI Flag of Buffer y (rh) */
    unsigned int RSI16:1;                   /**< \brief [16:16] RSI Flag of Buffer y (rh) */
    unsigned int RSI17:1;                   /**< \brief [17:17] RSI Flag of Buffer y (rh) */
    unsigned int RSI18:1;                   /**< \brief [18:18] RSI Flag of Buffer y (rh) */
    unsigned int RSI19:1;                   /**< \brief [19:19] RSI Flag of Buffer y (rh) */
    unsigned int RSI20:1;                   /**< \brief [20:20] RSI Flag of Buffer y (rh) */
    unsigned int RSI21:1;                   /**< \brief [21:21] RSI Flag of Buffer y (rh) */
    unsigned int RSI22:1;                   /**< \brief [22:22] RSI Flag of Buffer y (rh) */
    unsigned int RSI23:1;                   /**< \brief [23:23] RSI Flag of Buffer y (rh) */
    unsigned int RSI24:1;                   /**< \brief [24:24] RSI Flag of Buffer y (rh) */
    unsigned int RSI25:1;                   /**< \brief [25:25] RSI Flag of Buffer y (rh) */
    unsigned int RSI26:1;                   /**< \brief [26:26] RSI Flag of Buffer y (rh) */
    unsigned int RSI27:1;                   /**< \brief [27:27] RSI Flag of Buffer y (rh) */
    unsigned int RSI28:1;                   /**< \brief [28:28] RSI Flag of Buffer y (rh) */
    unsigned int RSI29:1;                   /**< \brief [29:29] RSI Flag of Buffer y (rh) */
    unsigned int RSI30:1;                   /**< \brief [30:30] RSI Flag of Buffer y (rh) */
    unsigned int RSI31:1;                   /**< \brief [31:31] RSI Flag of Buffer y (rh) */
} Ifx_PSI5_RSIOV_Bits;

