keeper999/EngineControl_Aurix/01_Get_Src/BSW/VD56_BSW/VD56_GEN_BSW/MCAL_TC29X_DRV_P1/Drv/IfxPsi5_regdef.h
/** \\brief  TEI Overview Register */
typedef struct _Ifx_PSI5_TEIOV_Bits
{
    unsigned int TEI0:1;                    /**< \brief [0:0] TEI Flag of Buffer y (rh) */
    unsigned int TEI1:1;                    /**< \brief [1:1] TEI Flag of Buffer y (rh) */
    unsigned int TEI2:1;                    /**< \brief [2:2] TEI Flag of Buffer y (rh) */
    unsigned int TEI3:1;                    /**< \brief [3:3] TEI Flag of Buffer y (rh) */
    unsigned int TEI4:1;                    /**< \brief [4:4] TEI Flag of Buffer y (rh) */
    unsigned int TEI5:1;                    /**< \brief [5:5] TEI Flag of Buffer y (rh) */
    unsigned int TEI6:1;                    /**< \brief [6:6] TEI Flag of Buffer y (rh) */
    unsigned int TEI7:1;                    /**< \brief [7:7] TEI Flag of Buffer y (rh) */
    unsigned int TEI8:1;                    /**< \brief [8:8] TEI Flag of Buffer y (rh) */
    unsigned int TEI9:1;                    /**< \brief [9:9] TEI Flag of Buffer y (rh) */
    unsigned int TEI10:1;                   /**< \brief [10:10] TEI Flag of Buffer y (rh) */
    unsigned int TEI11:1;                   /**< \brief [11:11] TEI Flag of Buffer y (rh) */
    unsigned int TEI12:1;                   /**< \brief [12:12] TEI Flag of Buffer y (rh) */
    unsigned int TEI13:1;                   /**< \brief [13:13] TEI Flag of Buffer y (rh) */
    unsigned int TEI14:1;                   /**< \brief [14:14] TEI Flag of Buffer y (rh) */
    unsigned int TEI15:1;                   /**< \brief [15:15] TEI Flag of Buffer y (rh) */
    unsigned int TEI16:1;                   /**< \brief [16:16] TEI Flag of Buffer y (rh) */
    unsigned int TEI17:1;                   /**< \brief [17:17] TEI Flag of Buffer y (rh) */
    unsigned int TEI18:1;                   /**< \brief [18:18] TEI Flag of Buffer y (rh) */
    unsigned int TEI19:1;                   /**< \brief [19:19] TEI Flag of Buffer y (rh) */
    unsigned int TEI20:1;                   /**< \brief [20:20] TEI Flag of Buffer y (rh) */
    unsigned int TEI21:1;                   /**< \brief [21:21] TEI Flag of Buffer y (rh) */
    unsigned int TEI22:1;                   /**< \brief [22:22] TEI Flag of Buffer y (rh) */
    unsigned int TEI23:1;                   /**< \brief [23:23] TEI Flag of Buffer y (rh) */
    unsigned int TEI24:1;                   /**< \brief [24:24] TEI Flag of Buffer y (rh) */
    unsigned int TEI25:1;                   /**< \brief [25:25] TEI Flag of Buffer y (rh) */
    unsigned int TEI26:1;                   /**< \brief [26:26] TEI Flag of Buffer y (rh) */
    unsigned int TEI27:1;                   /**< \brief [27:27] TEI Flag of Buffer y (rh) */
    unsigned int TEI28:1;                   /**< \brief [28:28] TEI Flag of Buffer y (rh) */
    unsigned int TEI29:1;                   /**< \brief [29:29] TEI Flag of Buffer y (rh) */
    unsigned int TEI30:1;                   /**< \brief [30:30] TEI Flag of Buffer y (rh) */
    unsigned int TEI31:1;                   /**< \brief [31:31] TEI Flag of Buffer y (rh) */
} Ifx_PSI5_TEIOV_Bits;

/** \\brief  TEIOV Set Register */
typedef struct _Ifx_PSI5_TEISET_Bits
{
    unsigned int TEI0:1;                    /**< \brief [0:0] Set TEI Flag of Buffer y (w) */
    unsigned int TEI1:1;                    /**< \brief [1:1] Set TEI Flag of Buffer y (w) */
    unsigned int TEI2:1;                    /**< \brief [2:2] Set TEI Flag of Buffer y (w) */
    unsigned int TEI3:1;                    /**< \brief [3:3] Set TEI Flag of Buffer y (w) */
    unsigned int TEI4:1;                    /**< \brief [4:4] Set TEI Flag of Buffer y (w) */
    unsigned int TEI5:1;                    /**< \brief [5:5] Set TEI Flag of Buffer y (w) */
    unsigned int TEI6:1;                    /**< \brief [6:6] Set TEI Flag of Buffer y (w) */
    unsigned int TEI7:1;                    /**< \brief [7:7] Set TEI Flag of Buffer y (w) */
    unsigned int TEI8:1;                    /**< \brief [8:8] Set TEI Flag of Buffer y (w) */
    unsigned int TEI9:1;                    /**< \brief [9:9] Set TEI Flag of Buffer y (w) */
    unsigned int TEI10:1;                   /**< \brief [10:10] Set TEI Flag of Buffer y (w) */
    unsigned int TEI11:1;                   /**< \brief [11:11] Set TEI Flag of Buffer y (w) */
    unsigned int TEI12:1;                   /**< \brief [12:12] Set TEI Flag of Buffer y (w) */
    unsigned int TEI13:1;                   /**< \brief [13:13] Set TEI Flag of Buffer y (w) */
    unsigned int TEI14:1;                   /**< \brief [14:14] Set TEI Flag of Buffer y (w) */
    unsigned int TEI15:1;                   /**< \brief [15:15] Set TEI Flag of Buffer y (w) */
    unsigned int TEI16:1;                   /**< \brief [16:16] Set TEI Flag of Buffer y (w) */
    unsigned int TEI17:1;                   /**< \brief [17:17] Set TEI Flag of Buffer y (w) */
    unsigned int TEI18:1;                   /**< \brief [18:18] Set TEI Flag of Buffer y (w) */
    unsigned int TEI19:1;                   /**< \brief [19:19] Set TEI Flag of Buffer y (w) */
    unsigned int TEI20:1;                   /**< \brief [20:20] Set TEI Flag of Buffer y (w) */
    unsigned int TEI21:1;                   /**< \brief [21:21] Set TEI Flag of Buffer y (w) */
    unsigned int TEI22:1;                   /**< \brief [22:22] Set TEI Flag of Buffer y (w) */
    unsigned int TEI23:1;                   /**< \brief [23:23] Set TEI Flag of Buffer y (w) */
    unsigned int TEI24:1;                   /**< \brief [24:24] Set TEI Flag of Buffer y (w) */
    unsigned int TEI25:1;                   /**< \brief [25:25] Set TEI Flag of Buffer y (w) */
    unsigned int TEI26:1;                   /**< \brief [26:26] Set TEI Flag of Buffer y (w) */
    unsigned int TEI27:1;                   /**< \brief [27:27] Set TEI Flag of Buffer y (w) */
    unsigned int TEI28:1;                   /**< \brief [28:28] Set TEI Flag of Buffer y (w) */
    unsigned int TEI29:1;                   /**< \brief [29:29] Set TEI Flag of Buffer y (w) */
    unsigned int TEI30:1;                   /**< \brief [30:30] Set TEI Flag of Buffer y (w) */
    unsigned int TEI31:1;                   /**< \brief [31:31] Set TEI Flag of Buffer y (w) */
} Ifx_PSI5_TEISET_Bits;

/** \\brief  Time Stamp Register */
typedef struct _Ifx_PSI5_TSR_Bits
{
    unsigned int CTS:24;                    /**< \brief [23:0] Current Time Stamp for the Module (r) */
    unsigned int ETB:3;                     /**< \brief [26:24] External Time Base Select (rw) */
    unsigned int TBS:1;                     /**< \brief [27:27] Time Base Select (rw) */
    unsigned int reserved_28:2;             /**< \brief \internal Reserved */
    unsigned int ACLR:1;                    /**< \brief [30:30] Clear All Current Time Stamp Counters (w) */
    unsigned int CLR:1;                     /**< \brief [31:31] Clear Current Time Stamp for the Module (w) */
} Ifx_PSI5_TSR_Bits;
/** \}  */
/******************************************************************************/
/******************************************************************************/
/** \addtogroup IfxLld_Psi5_union
 * \{  */

/** \\brief  Access Enable Register 0 */
typedef union
{
    /** \brief Unsigned access */
    unsigned int U;
    /** \brief Signed access */
    signed int I;
    /** \brief Bitfield access */
    Ifx_PSI5_ACCEN0_Bits B;
} Ifx_PSI5_ACCEN0;

/** \\brief  Access Enable Register 1 */
typedef union
{
    /** \brief Unsigned access */
    unsigned int U;
    /** \brief Signed access */
    signed int I;
    /** \brief Bitfield access */
    Ifx_PSI5_ACCEN1_Bits B;
} Ifx_PSI5_ACCEN1;

