keeper999/EngineControl_Aurix/01_Get_Src/BSW/VD56_BSW/VD56_GEN_BSW/MCAL_TC29X_DRV_P1/Drv/IfxPsi5_regdef.h
/** \\brief  PSI5 object */
typedef volatile struct _Ifx_PSI5
{
    Ifx_PSI5_CLC CLC;                       /**< \brief 0, Clock Control Register */
    unsigned char reserved_4[4];            /**< \brief 4, \internal Reserved */
    Ifx_PSI5_ID ID;                         /**< \brief 8, Module Identification Register */
    Ifx_PSI5_FDR FDR;                       /**< \brief C, SMU Fractional Divider Register */
    Ifx_PSI5_FDRL FDRL;                     /**< \brief 10, Fractional Divider Register for Lower Bit Rate */
    Ifx_PSI5_FDRH FDRH;                     /**< \brief 14, Fractional Divider Register for Higher Bit Rate */
    Ifx_PSI5_FDRT FDRT;                     /**< \brief 18, Fractional Divider Register for Time Stamp */
    Ifx_PSI5_TSR TSRA;                      /**< \brief 1C, Time Stamp Register A */
    Ifx_PSI5_TSR TSRB;                      /**< \brief 20, Time Stamp Register B */
    Ifx_PSI5_TSR TSRC;                      /**< \brief 24, Time Stamp Register C */
    unsigned char reserved_28[4];           /**< \brief 28, \internal Reserved */
    Ifx_PSI5_GCR GCR;                       /**< \brief 2C, Global Control Register */
    Ifx_PSI5_CH CH0;                        /**< \brief 30, Protection range */
    unsigned char reserved_AC[20];          /**< \brief AC, \internal Reserved */
    Ifx_PSI5_CH CH1;                        /**< \brief C0, Protection range */
    unsigned char reserved_13C[20];         /**< \brief 13C, \internal Reserved */
    Ifx_PSI5_CH CH2;                        /**< \brief 150, Protection range */
    unsigned char reserved_1CC[20];         /**< \brief 1CC, \internal Reserved */
    Ifx_PSI5_CH CH3;                        /**< \brief 1E0, Protection range */
    unsigned char reserved_25C[20];         /**< \brief 25C, \internal Reserved */
    Ifx_PSI5_CH CH4;                        /**< \brief 270, Protection range */
    unsigned char reserved_2EC[12];         /**< \brief 2EC, \internal Reserved */
    Ifx_PSI5_INTOV INTOV;                   /**< \brief 2F8, Interrupt Overview Register */
    Ifx_PSI5_INP INP[5];                    /**< \brief 2FC, Interrupt Node Pointer Register */
    Ifx_PSI5_INTSTATA INTSTATA[5];          /**< \brief 310, Interrupt Status Register A */
    Ifx_PSI5_INTSTATB INTSTATB[5];          /**< \brief 324, Interrupt Status Register B */
    Ifx_PSI5_INTSETA INTSETA[5];            /**< \brief 338, Interrupt Set Register A */
    Ifx_PSI5_INTSETB INTSETB[5];            /**< \brief 34C, Interrupt Set Register B */
    Ifx_PSI5_INTCLRA INTCLRA[5];            /**< \brief 360, Interrupt Clear Register A */
    Ifx_PSI5_INTCLRB INTCLRB[5];            /**< \brief 374, Interrupt Clear Register A */
    Ifx_PSI5_INTENA INTENA[5];              /**< \brief 388, Interrupt Enable Register A */
    Ifx_PSI5_INTENB INTENB[5];              /**< \brief 39C, Interrupt Enable Register B */
    unsigned char reserved_3B0[28];         /**< \brief 3B0, \internal Reserved */
    Ifx_PSI5_OCS OCS;                       /**< \brief 3CC, OCDS Control and Status */
    Ifx_PSI5_ACCEN0 ACCEN0;                 /**< \brief 3D0, Access Enable Register 0 */
    Ifx_PSI5_ACCEN1 ACCEN1;                 /**< \brief 3D4, Access Enable Register 1 */
    Ifx_PSI5_KRST0 KRST0;                   /**< \brief 3D8, Kernel Reset Register 0 */
    Ifx_PSI5_KRST1 KRST1;                   /**< \brief 3DC, Kernel Reset Register 1 */
    Ifx_PSI5_KRSTCLR KRSTCLR;               /**< \brief 3E0, Kernel Reset Status Clear Register */
    Ifx_PSI5_RFC RFC[5];                    /**< \brief 3E4, Receive FIFO Control Register */
    Ifx_PSI5_RDF RDF[5];                    /**< \brief 3F8, Receive Data FIFO */
    Ifx_PSI5_RSIOV RSIOV[5];                /**< \brief 40C, RSI Overview Register */
    Ifx_PSI5_RMIOV RMIOV[5];                /**< \brief 420, RMI Overview Register */
    Ifx_PSI5_NBIOV NBIOV[5];                /**< \brief 434, NBI Overview Register */
    Ifx_PSI5_TEIOV TEIOV[5];                /**< \brief 448, TEI Overview Register */
    Ifx_PSI5_CRCIOV CRCIOV[5];              /**< \brief 45C, CRCI Overview Register */
    Ifx_PSI5_RDIOV RDIOV[5];                /**< \brief 470, RDI Overview Register */
    Ifx_PSI5_NFIOV NFIOV[5];                /**< \brief 484, NFI Overview Register */
    Ifx_PSI5_MEIOV MEIOV[5];                /**< \brief 498, MEI Overview Register */
    Ifx_PSI5_RSISET RSISET[5];              /**< \brief 4AC, RSIOV Set Register */
    Ifx_PSI5_RMISET RMISET[5];              /**< \brief 4C0, RMIOV Set Register */
    Ifx_PSI5_NBISET NBISET[5];              /**< \brief 4D4, NBIOV Set Register */
    Ifx_PSI5_TEISET TEISET[5];              /**< \brief 4E8, TEIOV Set Register */
    Ifx_PSI5_CRCISET CRCISET[5];            /**< \brief 4FC, CRCIOV Set Register */
    Ifx_PSI5_RDISET RDISET[5];              /**< \brief 510, RDIOV Set Register */
    Ifx_PSI5_NFISET NFISET[5];              /**< \brief 524, NFIOV Set Register */
    Ifx_PSI5_MEISET MEISET[5];              /**< \brief 538, MEIOV Set Register */
    Ifx_PSI5_RSICLR RSICLR[5];              /**< \brief 54C, RSIOV Clear Register */
    Ifx_PSI5_RMICLR RMICLR[5];              /**< \brief 560, RMIOV Clear Register */
    Ifx_PSI5_NBICLR NBICLR[5];              /**< \brief 574, NBIOV Clear Register */
    Ifx_PSI5_TEICLR TEICLR[5];              /**< \brief 588, TEIOV Clear Register */
    Ifx_PSI5_CRCICLR CRCICLR[5];            /**< \brief 59C, CRCIOV Clear Register */
    Ifx_PSI5_RDICLR RDICLR[5];              /**< \brief 5B0, RDIOV Clear Register */
    Ifx_PSI5_NFICLR NFICLR[5];              /**< \brief 5C4, NFIOV Clear Register */
    Ifx_PSI5_MEICLR MEICLR[5];              /**< \brief 5D8, MEIOV Clear Register */
    unsigned char reserved_5EC[20];         /**< \brief 5EC, \internal Reserved */
    Ifx_PSI5_RDM RDM[5][32];                /**< \brief 600, Receive data memory */
} Ifx_PSI5;
/** \}  */
/******************************************************************************/
/** \}  */
/******************************************************************************/
/******************************************************************************/
#endif /* IFXPSI5_REGDEF_H */
